; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v5 - type_3 ?v2 - type_2)
 	      (pred_3 ?v4 - object ?v2 - type_2)
	      (pred_1 ?v5 - type_3 ?v1 - type_1)
	      (pred_2 ?v5 - type_3 ?v4 - object ?v1 - type_1))

   (:action op_3
       :parameters  (?v5 - type_3 ?v8 ?v7 - type_2)
       :precondition (and  (pred_4 ?v5 ?v8))
       :effect (and  (pred_4 ?v5 ?v7)
		     (not (pred_4 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_3 ?v3 - object ?v6 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v6) (pred_4 ?v5 ?v6) (pred_1 ?v5 ?v1))
       :effect (and (pred_2 ?v5 ?v3 ?v1)
		    (not (pred_3 ?v3 ?v6)) 
		    (not (pred_1 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_3 ?v3 - object ?v6 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v3 ?v1) (pred_4 ?v5 ?v6))
       :effect (and (pred_3 ?v3 ?v6)
		    (pred_1 ?v5 ?v1)
		    (not (pred_2 ?v5 ?v3 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_09 - type_3
obj_12 obj_08 obj_05 obj_07 - type_1
obj_04 obj_01 obj_06 obj_14 - type_2
obj_13 obj_03 obj_10 obj_11 - object)
(:init
(pred_4 obj_02 obj_06)
(pred_1 obj_02 obj_12)
(pred_1 obj_02 obj_08)
(pred_4 obj_09 obj_04)
(pred_1 obj_09 obj_05)
(pred_1 obj_09 obj_07)
(pred_3 obj_13 obj_04)
(pred_3 obj_03 obj_06)
(pred_3 obj_10 obj_06)
(pred_3 obj_11 obj_14)
)
(:goal
(and
(pred_3 obj_13 obj_14)
(pred_3 obj_03 obj_06)
(pred_3 obj_10 obj_06)
(pred_3 obj_11 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_14)))
)
)

; plan
1. (op_1 obj_09 obj_13 obj_04 obj_07)
   deleted: (pred_3 obj_13 obj_04) (pred_1 obj_09 obj_07)
   added: (pred_2 obj_09 obj_13 obj_07)
   goals met: 2 of 4
2. (op_3 obj_02 obj_06 obj_01)
   deleted: (pred_4 obj_02 obj_06)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 4
3. (op_3 obj_09 obj_04 obj_14)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_14)
   goals met: 2 of 4
4. (op_2 obj_09 obj_13 obj_14 obj_07)
   deleted: (pred_2 obj_09 obj_13 obj_07)
   added: (pred_3 obj_13 obj_14) (pred_1 obj_09 obj_07)
   goals met: 3 of 4
5. (op_1 obj_09 obj_11 obj_14 obj_05)
   deleted: (pred_3 obj_11 obj_14) (pred_1 obj_09 obj_05)
   added: (pred_2 obj_09 obj_11 obj_05)
   goals met: 3 of 4
6. (op_3 obj_09 obj_14 obj_01)
   deleted: (pred_4 obj_09 obj_14)
   added: (pred_4 obj_09 obj_01)
   goals met: 3 of 4
7. (op_2 obj_09 obj_11 obj_01 obj_05)
   deleted: (pred_2 obj_09 obj_11 obj_05)
   added: (pred_3 obj_11 obj_01) (pred_1 obj_09 obj_05)
   goals met: 4 of 4
